Revit 2026 API

# SolidCurveIntersection Methods

---

The SolidCurveIntersection type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetCurveSegment | Gets the curve segment generated by intersection. |
|  | GetCurveSegmentExtents | Gets the extents for the given curve segment generated by intersection. |
|  | GetEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

SolidCurveIntersection Class

Autodesk.Revit.DB Namespace